---
kind: property
id: P:Autodesk.Revit.DB.CurveByPoints.IsReferenceLine
source: html/2ac6587c-96da-d275-04d0-77363583c9ba.htm
---
# Autodesk.Revit.DB.CurveByPoints.IsReferenceLine Property

## Syntax (C#)
```csharp
public bool IsReferenceLine { get; set; }
```